# Practice_Part_06: Data Wrangling

In [1]:
import pandas as pd,numpy as np

#### Exercise_01
For the titanic data set in 'data/titanic':
1. Set the MultiIndex for the data with the columns 'sex' and 'name'
2. Extract the columns ['sex', 'name', 'survived', 'pclass'] as two separate data sets and combine them using join method
3. Concat the two data sets given below with the lavel names as 'data1' and 'data2'
4. Stack the titanic data on the columns 'sex' and 'name' and observe how the data looks

In [11]:
df = pd.read_csv('data/titanic/original_titanic.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [16]:
df_index = df.set_index(['sex','name'])
df_index.head()

,,pclass,survived,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
sex,name,,,,,,,,,,,,
female,"Allen, Miss. Elisabeth Walton",1,1,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
male,"Allison, Master. Hudson Trevor",1,1,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
female,"Allison, Miss. Helen Loraine",1,0,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
male,"Allison, Mr. Hudson Joshua Creighton",1,0,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
female,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [17]:
df_index1 = df.set_index(['sex','name'],drop=False)
df_index1.head()

,,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
sex,name,,,,,,,,,,,,,,
female,"Allen, Miss. Elisabeth Walton",1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
male,"Allison, Master. Hudson Trevor",1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
female,"Allison, Miss. Helen Loraine",1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
male,"Allison, Mr. Hudson Joshua Creighton",1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
female,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [18]:
df_1 = df[['sex', 'name', 'survived']]
df_1.head()

      sex                                             name  survived
0  female                    Allen, Miss. Elisabeth Walton         1
1    male                   Allison, Master. Hudson Trevor         1
2  female                     Allison, Miss. Helen Loraine         0
3    male             Allison, Mr. Hudson Joshua Creighton         0
4  female  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)         0

In [19]:
df_2 = df[['pclass','survived','sex']]
df_2.head()

   pclass  survived     sex
0       1         1  female
1       1         1    male
2       1         0  female
3       1         0    male
4       1         0  female

In [20]:
df_join = df_1.join(df_2, lsuffix='_df_1',rsuffix='_df_2')
df_join

,sex_df_1,name,survived_df_1,pclass,survived_df_2,sex_df_2
0,female,"Allen, Miss. Elisabeth Walton",1,1,1,female
1,male,"Allison, Master. Hudson Trevor",1,1,1,male
2,female,"Allison, Miss. Helen Loraine",0,1,0,female
3,male,"Allison, Mr. Hudson Joshua Creighton",0,1,0,male
4,female,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",0,1,0,female
...,...,...,...,...,...,...
1304,female,"Zabour, Miss. Hileni",0,3,0,female
1305,female,"Zabour, Miss. Thamine",0,3,0,female
1306,male,"Zakarian, Mr. Mapriededer",0,3,0,male
1307,male,"Zakarian, Mr. Ortin",0,3,0,male
1308,male,"Zimmerman, Mr. Leo",0,3,0,male

In [31]:
data1 = df[['sex', 'name', 'survived']]
data2 = df[['pclass','age','cabin']]

In [32]:
data1.head()

      sex                                             name  survived
0  female                    Allen, Miss. Elisabeth Walton         1
1    male                   Allison, Master. Hudson Trevor         1
2  female                     Allison, Miss. Helen Loraine         0
3    male             Allison, Mr. Hudson Joshua Creighton         0
4  female  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)         0

In [33]:
data2.head()

   pclass    age    cabin
0       1  29.00       B5
1       1   0.92  C22 C26
2       1   2.00  C22 C26
3       1  30.00  C22 C26
4       1  25.00  C22 C26

In [38]:
pd.concat([data1,data2],axis=1,join='outer',keys=['data1','data2'])

       data1                                                            data2  \
         sex                                             name survived pclass
0     female                    Allen, Miss. Elisabeth Walton        1      1
1       male                   Allison, Master. Hudson Trevor        1      1
2     female                     Allison, Miss. Helen Loraine        0      1
3       male             Allison, Mr. Hudson Joshua Creighton        0      1
4     female  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)        0      1
...      ...                                              ...      ...    ...
1304  female                             Zabour, Miss. Hileni        0      3
1305  female                            Zabour, Miss. Thamine        0      3
1306    male                        Zakarian, Mr. Mapriededer        0      3
1307    male                              Zakarian, Mr. Ortin        0      3
1308    male                               Zimmerman, Mr. Leo        0      3


        age    cabin
0     29.00       B5
1      0.92  C22 C26
2      2.00  C22 C26
3     30.00  C22 C26
4     25.00  C22 C26
...     ...      ...
1304  14.50      NaN
1305    NaN      NaN
1306  26.50      NaN
1307  27.00      NaN
1308  29.00      NaN

[1309 rows x 6 columns]

In [40]:
pd.concat([data1,data2],axis=1,join='inner',keys=['data1','data2'],sort=True)

       data1                                                            data2  \
         sex                                             name survived pclass
0     female                    Allen, Miss. Elisabeth Walton        1      1
1       male                   Allison, Master. Hudson Trevor        1      1
2     female                     Allison, Miss. Helen Loraine        0      1
3       male             Allison, Mr. Hudson Joshua Creighton        0      1
4     female  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)        0      1
...      ...                                              ...      ...    ...
1304  female                             Zabour, Miss. Hileni        0      3
1305  female                            Zabour, Miss. Thamine        0      3
1306    male                        Zakarian, Mr. Mapriededer        0      3
1307    male                              Zakarian, Mr. Ortin        0      3
1308    male                               Zimmerman, Mr. Leo        0      3


        age    cabin
0     29.00       B5
1      0.92  C22 C26
2      2.00  C22 C26
3     30.00  C22 C26
4     25.00  C22 C26
...     ...      ...
1304  14.50      NaN
1305    NaN      NaN
1306  26.50      NaN
1307  27.00      NaN
1308  29.00      NaN

[1309 rows x 6 columns]

In [41]:
df_reindex = df.set_index(['sex','name'])
df_reindex

                                                        pclass  survived  \
sex    name
female Allen, Miss. Elisabeth Walton                         1         1
male   Allison, Master. Hudson Trevor                        1         1
female Allison, Miss. Helen Loraine                          1         0
male   Allison, Mr. Hudson Joshua Creighton                  1         0
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1         0
...                                                        ...       ...
       Zabour, Miss. Hileni                                  3         0
       Zabour, Miss. Thamine                                 3         0
male   Zakarian, Mr. Mapriededer                             3         0
       Zakarian, Mr. Ortin                                   3         0
       Zimmerman, Mr. Leo                                    3         0

                                                          age  sibsp  parch  \
sex    name
female Allen, Miss. Elisabeth Walton                    29.00      0      0
male   Allison, Master. Hudson Trevor                    0.92      1      2
female Allison, Miss. Helen Loraine                      2.00      1      2
male   Allison, Mr. Hudson Joshua Creighton             30.00      1      2
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00      1      2
...                                                       ...    ...    ...
       Zabour, Miss. Hileni                             14.50      1      0
       Zabour, Miss. Thamine                              NaN      1      0
male   Zakarian, Mr. Mapriededer                        26.50      0      0
       Zakarian, Mr. Ortin                              27.00      0      0
       Zimmerman, Mr. Leo                               29.00      0      0

                                                        ticket      fare  \
sex    name
female Allen, Miss. Elisabeth Walton                     24160  211.3375
male   Allison, Master. Hudson Trevor                   113781  151.5500
female Allison, Miss. Helen Loraine                     113781  151.5500
male   Allison, Mr. Hudson Joshua Creighton             113781  151.5500
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  113781  151.5500
...                                                        ...       ...
       Zabour, Miss. Hileni                               2665   14.4542
       Zabour, Miss. Thamine                              2665   14.4542
male   Zakarian, Mr. Mapriededer                          2656    7.2250
       Zakarian, Mr. Ortin                                2670    7.2250
       Zimmerman, Mr. Leo                               315082    7.8750

                                                          cabin embarked boat  \
sex    name
female Allen, Miss. Elisabeth Walton                         B5        S    2
male   Allison, Master. Hudson Trevor                   C22 C26        S   11
female Allison, Miss. Helen Loraine                     C22 C26        S  NaN
male   Allison, Mr. Hudson Joshua Creighton             C22 C26        S  NaN
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  C22 C26        S  NaN
...                                                         ...      ...  ...
       Zabour, Miss. Hileni                                 NaN        C  NaN
       Zabour, Miss. Thamine                                NaN        C  NaN
male   Zakarian, Mr. Mapriededer                            NaN        C  NaN
       Zakarian, Mr. Ortin                                  NaN        C  NaN
       Zimmerman, Mr. Leo                                   NaN        S  NaN

                                                         body  \
sex    name
female Allen, Miss. Elisabeth Walton                      NaN
male   Allison, Master. Hudson Trevor                     NaN
female Allison, Miss. Helen Loraine                       NaN
male   Allison, Mr. Hudson Joshua Creighton             135.0
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    NaN
...                                                       ...
       Zabour, Miss. Hileni                             328.0
       Zabour, Miss. Thamine                              NaN
male   Zakarian, Mr. Mapriededer                        304.0
       Zakarian, Mr. Ortin                                NaN
       Zimmerman, Mr. Leo                                 NaN

                                                                              home.dest
sex    name
female Allen, Miss. Elisabeth Walton                                       St Louis, MO
male   Allison, Master. Hudson Trevor                   Montreal, PQ / Chesterville, ON
female Allison, Miss. Helen Loraine                     Montreal, PQ / Chesterville, ON
male   Allison, Mr. Hudson Joshua Creighton             Montreal, PQ / Chesterville, ON
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  Montreal, PQ / Chesterville, ON
...                                                                                 ...
       Zabour, Miss. Hileni                                                         NaN
       Zabour, Miss. Thamine                                                        NaN
male   Zakarian, Mr. Mapriededer                                                    NaN
       Zakarian, Mr. Ortin                                                          NaN
       Zimmerman, Mr. Leo                                                           NaN

[1309 rows x 12 columns]

In [42]:
df_reindex.stack()

sex     name
female  Allen, Miss. Elisabeth Walton  pclass           1
                                       survived         1
                                       age           29.0
                                       sibsp            0
                                       parch            0
                                                    ...
male    Zimmerman, Mr. Leo             sibsp            0
                                       parch            0
                                       ticket      315082
                                       fare         7.875
                                       embarked         S
Length: 11853, dtype: object